/*
Задача 1: Переворот слов (без массива)
          Напишите программу, которая принимает строку и переставляет слова в обратном порядке,
          используя только методы String и StringBuild.
Задача 2: Преобразование строки в ASCII коды и обратно
          Реализуйте программу, которая преобразует строку в последовательность ASCII-кодов
          и строку кодов в текст, используя циклы и методы String.
 */

fun main () {
    print("Введите строку, содержащую пробелы: ")
    val str: String = readln()
}